#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: @logica0419, Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
sakuracloud_switch.k8s-internal-switch: Refreshing state... [id=113501609997]
sakuracloud_disk.k8s-rook-disk[2]: Refreshing state... [id=113501610003]
sakuracloud_internet.k8s-external-switch: Refreshing state... [id=113501609999]
sakuracloud_disk.k8s-rook-disk[0]: Refreshing state... [id=113501609995]
data.sakuracloud_archive.ubuntu-archive: Reading...
sakuracloud_disk.k8s-rook-disk[1]: Refreshing state... [id=113501609998]
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113501610010]
data.sakuracloud_archive.ubuntu-archive: Read complete after 1s [id=113402076881]
sakuracloud_disk.k8s-node-disk[2]: Refreshing state... [id=113501610008]
sakuracloud_disk.k8s-master-disk[0]: Refreshing state... [id=113501610005]
sakuracloud_disk.k8s-router-disk[0]: Refreshing state... [id=113501609996]
sakuracloud_disk.k8s-master-disk[2]: Refreshing state... [id=113501610009]
sakuracloud_disk.k8s-master-disk[1]: Refreshing state... [id=113501610000]
sakuracloud_disk.k8s-node-disk[0]: Refreshing state... [id=113501610007]
sakuracloud_disk.k8s-node-disk[1]: Refreshing state... [id=113501610004]
sakuracloud_disk.k8s-lb-disk[0]: Refreshing state... [id=113501610001]
sakuracloud_disk.k8s-lb-disk[1]: Refreshing state... [id=113501609994]
sakuracloud_server.k8s-master-server[2]: Refreshing state... [id=113501610032]
sakuracloud_server.k8s-master-server[0]: Refreshing state... [id=113501610033]
sakuracloud_server.k8s-node-server[1]: Refreshing state... [id=113501610023]
sakuracloud_subnet.bgp-subnet: Refreshing state... [id=15259]
sakuracloud_server.k8s-master-server[1]: Refreshing state... [id=113501610031]
sakuracloud_server.k8s-node-server[2]: Refreshing state... [id=113501610021]
sakuracloud_server.k8s-lb-server[0]: Refreshing state... [id=113501610013]
sakuracloud_server.k8s-node-server[0]: Refreshing state... [id=113501610022]
sakuracloud_server.k8s-router[0]: Refreshing state... [id=113501610018]
sakuracloud_server.k8s-lb-server[1]: Refreshing state... [id=113501610012]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s-lb-disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s-lb-disk" {
      ~ id                = "113501610001" -> (known after apply)
        name              = "k8s-lb-1-dev"
      ~ server_id         = "113501610013" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s-lb-disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s-lb-disk" {
      ~ id                = "113501609994" -> (known after apply)
        name              = "k8s-lb-2-dev"
      ~ server_id         = "113501610012" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s-master-disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s-master-disk" {
      ~ id                = "113501610005" -> (known after apply)
        name              = "k8s-master-1-dev"
      ~ server_id         = "113501610033" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s-master-disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s-master-disk" {
      ~ id                = "113501610000" -> (known after apply)
        name              = "k8s-master-2-dev"
      ~ server_id         = "113501610031" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s-master-disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s-master-disk" {
      ~ id                = "113501610009" -> (known after apply)
        name              = "k8s-master-3-dev"
      ~ server_id         = "113501610032" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s-node-disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s-node-disk" {
      ~ id                = "113501610007" -> (known after apply)
        name              = "k8s-node-1-dev"
      ~ server_id         = "113501610022" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s-node-disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s-node-disk" {
      ~ id                = "113501610004" -> (known after apply)
        name              = "k8s-node-2-dev"
      ~ server_id         = "113501610023" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s-node-disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s-node-disk" {
      ~ id                = "113501610008" -> (known after apply)
        name              = "k8s-node-3-dev"
      ~ server_id         = "113501610021" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s-router-disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s-router-disk" {
      ~ id                = "113501609996" -> (known after apply)
        name              = "k8s-router-1-dev"
      ~ server_id         = "113501610018" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s-lb-server[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s-lb-server" {
      ~ disks            = [
          - "113501610001",
        ] -> (known after apply)
        id               = "113501610013"
        name             = "k8s-lb-1-server-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s-lb-server[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s-lb-server" {
      ~ disks            = [
          - "113501609994",
        ] -> (known after apply)
        id               = "113501610012"
        name             = "k8s-lb-2-server-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s-master-server[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s-master-server" {
      ~ disks            = [
          - "113501610005",
        ] -> (known after apply)
        id               = "113501610033"
        name             = "k8s-master-1-server-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s-master-server[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s-master-server" {
      ~ disks            = [
          - "113501610000",
        ] -> (known after apply)
        id               = "113501610031"
        name             = "k8s-master-2-server-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s-master-server[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s-master-server" {
      ~ disks            = [
          - "113501610009",
        ] -> (known after apply)
        id               = "113501610032"
        name             = "k8s-master-3-server-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s-node-server[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s-node-server" {
      ~ disks            = [
          - "113501610007",
          - "113501609995",
        ] -> (known after apply)
        id               = "113501610022"
        name             = "k8s-node-1-server-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s-node-server[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s-node-server" {
      ~ disks            = [
          - "113501610004",
          - "113501609998",
        ] -> (known after apply)
        id               = "113501610023"
        name             = "k8s-node-2-server-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s-node-server[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s-node-server" {
      ~ disks            = [
          - "113501610008",
          - "113501610003",
        ] -> (known after apply)
        id               = "113501610021"
        name             = "k8s-node-3-server-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s-router[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s-router" {
      ~ disks            = [
          - "113501609996",
        ] -> (known after apply)
        id               = "113501610018"
        name             = "k8s-router-1-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 9 to add, 9 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>